Repository: bestdeejay-design/sweet-no-sleep
Catalog: Sources/SweetNoSleep/Localizable.xcstrings
Source language: en
Languages: es, ja, ko, ru, zh_hans

source: Keep the display on during a session
es: Mantener la pantalla encendida durante la sesión
ja: セッション中はディスプレイをオンのままにする
ko: 세션 중 디스플레이 켜 두기
ru: Не выключать дисплей во время сессии
zh_hans: 会话期间保持显示器开启

source: Keep the system awake until you turn this off
es: Mantener el sistema despierto hasta que lo desactives
ja: オフにするまでシステムを起こしておく
ko: 끌 때까지 시스템을 깨워 두기
ru: Не давать системе засыпать, пока ты не выключишь это
zh_hans: 保持系统唤醒，直到你关闭此选项

source: Last power event
es: Último evento de energía
ja: 直近の電源イベント
ko: 마지막 전원 이벤트
ru: Последнее событие питания
zh_hans: 最近的电源事件

source: Launch Sweet No Sleep at login
es: Abrir Sweet No Sleep al iniciar sesión
ja: ログイン時に Sweet No Sleep を起動
ko: 로그인 시 Sweet No Sleep 실행
ru: Запускать Sweet No Sleep при входе
zh_hans: 登录时启动 Sweet No Sleep

source: Launch at login
es: Abrir al iniciar sesión
ja: ログイン時に起動
ko: 로그인 시 실행
ru: Запуск при входе
zh_hans: 登录时启动

source: Launch at login requires macOS 13 or later.
es: Abrir al iniciar sesión requiere macOS 13 o posterior.
ja: ログイン時の起動には macOS 13 以降が必要です。
ko: 로그인 시 실행은 macOS 13 이상이 필요해요.
ru: Запуск при входе требует macOS 13 или новее.
zh_hans: 登录时启动需要 macOS 13 或更高版本。

source: Leave this off if you do not want to use battery after a restart.
es: Déjalo desactivado si no quieres gastar batería tras un reinicio.
ja: 再起動後にバッテリーを使いたくない場合はオフのままにしてください。
ko: 재시작 후 배터리를 쓰고 싶지 않다면 끄세요.
ru: Оставь выключенным, если не хочешь расходовать батарею после перезагрузки.
zh_hans: 如果不希望重启后消耗电池，请保持关闭。

source: Live status of power assertions, battery polling, and kernel timers.
es: Estado en vivo de los bloqueos de energía, el sondeo de batería y los temporizadores del kernel.
ja: 電源アサーション、バッテリーのポーリング、カーネルタイマーのリアルタイム状態。
ko: 전원 어서션, 배터리 폴링, 커널 타이머의 실시간 상태.
ru: Текущее состояние блокировок питания, опроса батареи и таймеров ядра.
zh_hans: 电源断言、电池轮询和内核计时器的实时状态。

source: Local hooks can tell %@ when work starts, send heartbeats, report completion, or ask for your approval.
es: Los hooks locales pueden avisar a %@ cuando empieza el trabajo, enviar heartbeats, informar de la finalización o pedir tu aprobación.
ja: ローカルフックは、作業の開始を%@に伝えたり、heartbeat を送ったり、完了を報告したり、承認を求めたりできます。
ko: 로컬 훅은 작업이 시작될 때 %@에게 알리고, heartbeat를 보내며, 완료를 보고하거나 승인을 요청할 수 있어요.
ru: Локальные хуки могут сообщить %@, что работа началась, отправлять heartbeat, сообщать о завершении или запрашивать твоё подтверждение.
zh_hans: 本地钩子可以在工作开始时告诉 %@，发送心跳（heartbeat），报告完成，或请求你的确认。

source: Local webhook
es: Webhook local
ja: ローカル webhook
ko: 로컬 웹훅
ru: Локальный webhook
zh_hans: 本地 webhook

source: Look away from your code and focus on something in the distance for about 20 seconds.
es: Aparta la vista del código y mira algo lejano durante unos 20 segundos.
ja: コードから目を離し、約20秒間遠くを見てください。
ko: 코드에서 눈을 떼고 약 20초 동안 먼 곳을 바라보세요.
ru: Отведи взгляд от кода и около 20 секунд смотри вдаль.
zh_hans: 把视线从代码上移开，望向远处约 20 秒。

source: Loopback-only HTTP listener on 127.0.0.1:18290 for sandboxed runners that cannot open URL schemes.
es: Escucha HTTP solo de loopback en 127.0.0.1:18290 para ejecutores en sandbox que no pueden abrir esquemas de URL.
ja: 127.0.0.1:18290 でのみ受け付ける HTTP リスナーです。URL スキームを開けないサンドボックス内のランナー向けです。
ko: 127.0.0.1:18290에서만 응답하는 HTTP 리스너로, URL 스킴을 열 수 없는 샌드박스 실행기용이에요.
ru: HTTP-слушатель только для loopback на 127.0.0.1:18290 для изолированных запускателей, которые не могут открывать URL-схемы.
zh_hans: 仅限回环的 HTTP 监听器，位于 127.0.0.1:18290，供无法打开 URL 方案的沙盒运行器使用。

source: Mac is protected from idle sleep
es: El Mac está protegido contra la suspensión por inactividad
ja: Macはアイドル時のスリープから保護されています
ko: Mac은 유휴 절전으로부터 보호되고 있어요
ru: Mac защищён от сна при простое
zh_hans: Mac 已受保护，不会因空闲而睡眠

source: Mood weights - higher values make a mood more likely; 0 turns it off.
es: Pesos del ánimo: cuanto mayor es el valor, más probable es el ánimo; 0 lo desactiva.
ja: 気分の重み: 値が大きいほどその気分が出やすくなります。0でオフになります。
ko: 기분 가중치 - 값이 클수록 해당 기분이 자주 나타나요. 0이면 꺼요.
ru: Веса настроений — чем выше значение, тем вероятнее настроение; 0 — выключает его.
zh_hans: 情绪权重：数值越高，该情绪越容易出现；0 表示关闭。

source: New token
es: Nuevo token
ja: 新しいトークン
ko: 새 토큰
ru: Новый токен
zh_hans: 新令牌

source: Next re-arm
es: Próxima reactivación
ja: 次の再設定
ko: 다음 재설정
ru: Следующая повторная активация
zh_hans: 下次重新启用

source: Nice break - I'll gently remind you again in %d min
es: Buen descanso - te lo recordaré de nuevo en %d min
ja: いい休憩ですね - %d分後にまたお知らせします
ko: 좋은 휴식이에요 - %d분 뒤에 다시 살짝 알려 드릴게요
ru: Отличный перерыв — напомню тебе снова через %d мин
zh_hans: 休息得不错 - %d 分钟后我会再温柔提醒你

source: None
es: Ninguno
ja: なし
ko: 없음
ru: Нет
zh_hans: 无

source: Not now
es: Ahora no
ja: 今はしない
ko: 지금은 안 함
ru: Не сейчас
zh_hans: 暂不

source: ON DUTY
es: DE GUARDIA
ja: 勤務中
ko: 근무 중
ru: НА ДЕЖУРСТВЕ
zh_hans: 值班中

source: Occasional dances, stretches, and curious looks
es: Bailes, estiramientos y miradas curiosas de vez en cuando
ja: ときどきダンス、ストレッチ、好奇心いっぱいの仕草
ko: 가끔 춤추기, 기지개, 호기심 어린 눈빛
ru: Иногда танцы, растяжка и любопытные взгляды
zh_hans: 偶尔跳舞、伸懒腰和好奇张望

source: Okay - I'll remind you again in %d min
es: Vale - te lo recordaré de nuevo en %d min
ja: わかりました - %d分後にまたお知らせします
ko: 알겠어요 - %d분 뒤에 다시 알려 드릴게요
ru: Хорошо — напомню снова через %d мин
zh_hans: 好的 - %d 分钟后再提醒你

source: One agent heartbeat expired - other sessions are still active
es: El heartbeat de un agente caducó - las demás sesiones siguen activas
ja: エージェント1件のheartbeatが期限切れになりました - 他のセッションは引き続きアクティブです
ko: 에이전트 하나의 heartbeat가 만료됐어요 - 다른 세션은 아직 활성 상태예요
ru: Heartbeat одного агента истёк — остальные сессии всё ещё активны
zh_hans: 一个智能体的心跳已过期 - 其他会话仍处于活跃状态

source: Open Login Items
es: Abrir Elementos de inicio de sesión
ja: ログイン項目を開く
ko: 로그인 항목 열기
ru: Открыть объекты входа
zh_hans: 打开登录项

source: Open apps and agents may be interrupted. To use the normal idle-sleep behavior, choose 'Allow normal sleep' in Settings.
es: Las apps y agentes abiertos podrían interrumpirse. Para usar el comportamiento normal de suspensión por inactividad, elige «Permitir suspensión normal» en Ajustes.
ja: 開いているアプリやエージェントが中断される可能性があります。通常のアイドル時スリープの動作にするには、設定で「通常のスリープを許可」を選択してください。
ko: 열려 있는 앱과 에이전트가 중단될 수 있어요. 일반 유휴 절전 동작을 쓰려면 설정에서 ‘일반 절전 허용’을 선택하세요.
ru: Открытые приложения и агенты могут быть прерваны. Чтобы использовать обычное поведение сна при простое, выбери «Разрешить обычный сон» в Настройках.
zh_hans: 已打开的应用和智能体可能会被中断。要使用正常的空闲睡眠行为，请在设置中选择“允许正常睡眠”。

source: Open skins folder
es: Abrir carpeta de skins
ja: スキンのフォルダを開く
ko: 스킨 폴더 열기
ru: Открыть папку скинов
zh_hans: 打开皮肤文件夹

source: POST to http://127.0.0.1:18290/agent/<start|heartbeat|waiting|done|failed> with a JSON body {"session": "id", "reason": "text"} and the Authorization: Bearer header. Same 3-minute lease as the URL bridge.
es: Envía un POST a http://127.0.0.1:18290/agent/<start|heartbeat|waiting|done|failed> con un cuerpo JSON {"session": "id", "reason": "text"} y la cabecera Authorization: Bearer. Misma concesión de 3 minutos que el puente de URL.
ja: http://127.0.0.1:18290/agent/<start|heartbeat|waiting|done|failed> へ POST し、JSON 本文 {"session": "id", "reason": "text"} と Authorization: Bearer ヘッダーを付けてください。URL ブリッジと同じ 3 分間のリースです。
ko: POST 요청을 http://127.0.0.1:18290/agent/<start|heartbeat|waiting|done|failed> 주소로 보내세요. 본문은 JSON {"session": "id", "reason": "text"}이고, Authorization: Bearer 헤더를 함께 보내요. URL 브리지와 같은 3분 임대 시간이 적용돼요.
ru: Отправь POST-запрос на http://127.0.0.1:18290/agent/<start|heartbeat|waiting|done|failed> с JSON-телом {"session": "id", "reason": "text"} и заголовком Authorization: Bearer. Тот же 3-минутный срок аренды, что у URL-моста.
zh_hans: 向 http://127.0.0.1:18290/agent/<start|heartbeat|waiting|done|failed> 发送 POST，JSON 正文为 {"session": "id", "reason": "text"}，并带上 Authorization: Bearer 请求头。与 URL 桥接相同的 3 分钟租约。

source: Pause sleep protection when battery charge drops below a safe level. Protection resumes when plugged in.
es: Pausa la protección contra suspensión cuando la carga de la batería baje de un nivel seguro. La protección se reanuda al conectar el cargador.
ja: バッテリー残量が安全なレベルを下回ると、スリープ防止を一時停止します。電源に接続すると再開します。
ko: 배터리 충전량이 안전 수준 아래로 떨어지면 절전 방지를 일시 중지해요. 충전기를 연결하면 다시 시작돼요.
ru: Приостанавливать защиту от сна, когда заряд батареи падает ниже безопасного уровня. Защита возобновляется при подключении к сети.
zh_hans: 当电池电量降至安全水平以下时暂停防休眠保护。接通电源后保护会恢复。

source: Pet
es: Mascota
ja: ペット
ko: 펫
ru: Питомец
zh_hans: 宠物

source: Pet size
es: Tamaño de la mascota
ja: ペットのサイズ
ko: 펫 크기
ru: Размер питомца
zh_hans: 宠物大小

source: Playful moment interval
es: Intervalo de momentos juguetones
ja: 遊びの演出の間隔
ko: 장난스러운 순간 간격
ru: Интервал игривых моментов
zh_hans: 俏皮瞬间间隔

source: Port 18290 is already in use
es: El puerto 18290 ya está en uso
ja: ポート18290は既に使用中です
ko: 포트 18290이 이미 사용 중이에요
ru: Порт 18290 уже занят
zh_hans: 端口 18290 已被占用

source: Power
es: Energía
ja: 電源
ko: 전원
ru: Питание
zh_hans: 电源

source: Power and startup
es: Energía e inicio
ja: 電源と起動
ko: 전원 및 시작
ru: Питание и запуск
zh_hans: 电源与启动

source: Power restored - sleep protection resumed.
es: Energía restablecida - protección contra suspensión reanudada.
ja: 電源が復旧 - スリープ防止を再開しました。
ko: 전원이 복구됐어요 - 절전 방지가 다시 시작됐어요.
ru: Питание восстановлено — защита от сна возобновлена.
zh_hans: 电源已恢复 - 防休眠保护已恢复。

source: Power restored: assertions resumed
es: Energía restablecida: bloqueos reanudados
ja: 電源復旧: アサーションを再開
ko: 전원 복구: 어서션 재개됨
ru: Питание восстановлено: блокировки возобновлены
zh_hans: 电源已恢复：电源断言已恢复

source: Power source
es: Fuente de energía
ja: 電源
ko: 전원 공급원
ru: Источник питания
zh_hans: 电源来源

source: Power status
es: Estado de la energía
ja: 電源の状態
ko: 전원 상태
ru: Состояние питания
zh_hans: 电源状态

source: Protection remains active while heartbeats arrive. After 3 minutes without a signal, %@ releases the assertion so the Mac is not kept awake indefinitely.
es: La protección sigue activa mientras lleguen heartbeats. Tras 3 minutos sin señal, %@ libera el bloqueo para que el Mac no se mantenga despierto indefinidamente.
ja: heartbeat が届いている間は保護が続きます。3分間信号がないと、%@がアサーションを解除し、Macが無期限に起きたままになるのを防ぎます。
ko: heartbeat 신호가 들어오는 동안 보호가 유지돼요. 3분 동안 신호가 없으면 %@ 쪽에서 어서션을 해제해, Mac이 무기한 깨어 있지 않도록 해요.
ru: Защита остаётся активной, пока приходят heartbeat-сигналы. Если сигнала нет 3 минуты, %@ снимает блокировку, чтобы Mac не оставался активным бесконечно.
zh_hans: 心跳信号到达期间保护持续有效。若 3 分钟内没有信号，%@ 会释放电源断言，避免 Mac 无限期保持唤醒。

source: Put the Mac to sleep immediately
es: Suspender el Mac de inmediato
ja: Macを今すぐスリープさせる
ko: Mac을 즉시 절전 상태로 두기
ru: Немедленно усыпить Mac
zh_hans: 立即让 Mac 睡眠

source: Quick switch
es: Cambio rápido
ja: クイック切り替え
ko: 빠른 전환
ru: Быстрое переключение
zh_hans: 快速切换

source: Quit
es: Salir
ja: 終了
ko: 종료
ru: Выйти
zh_hans: 退出

source: Quit Sweet No Sleep
es: Salir de Sweet No Sleep
ja: Sweet No Sleep を終了
ko: Sweet No Sleep 종료
ru: Выйти из Sweet No Sleep
zh_hans: 退出 Sweet No Sleep

source: RESTING
es: DESCANSANDO
ja: 休止中
ko: 휴식 중
ru: ОТДЫХ
zh_hans: 休息中

source: Refresh list
es: Actualizar lista
ja: リストを更新
ko: 목록 새로 고침
ru: Обновить список
zh_hans: 刷新列表

source: Release the sleep assertion and let macOS use its normal energy settings.
es: Libera el bloqueo de suspensión y deja que macOS use sus ajustes normales de energía.
ja: スリープのアサーションを解除し、macOSの通常の省エネ設定に任せます。
ko: 절전 어서션을 해제하고 macOS의 일반 에너지 설정을 따르게 해요.
ru: Снять блокировку сна и позволить macOS использовать обычные настройки энергопотребления.
zh_hans: 释放睡眠断言，让 macOS 使用其正常的节能设置。

source: Remind me to take a short break
es: Recordarme que haga una pausa breve
ja: 短い休憩をとるよう通知
ko: 짧은 휴식을 취하라고 알려주기
ru: Напоминать мне делать короткий перерыв
zh_hans: 提醒我短暂休息

source: Roam gently across the screen
es: Pasear suavemente por la pantalla
ja: 画面の中をゆっくり散歩
ko: 화면을 천천히 돌아다니기
ru: Неспешно бродить по экрану
zh_hans: 在屏幕上轻轻漫步

source: SLEEP WHEN DONE
es: DORMIR AL TERMINAR
ja: 完了後にスリープ
ko: 완료 후 절전
ru: СОН ПО ЗАВЕРШЕНИИ
zh_hans: 完成后睡眠

source: Selected: %d minutes
es: Seleccionado: %d min
ja: 選択中: %d分
ko: 선택됨: %d분
ru: Выбрано: %d мин
zh_hans: 已选择：%d 分钟

source: Session duration in minutes
es: Duración de la sesión en minutos
ja: セッションの時間（分）
ko: 세션 시간(분)
ru: Длительность сессии в минутах
zh_hans: 会话时长（分钟）

source: Session ended, but sleep did not start: %@
es: La sesión terminó, pero la suspensión no se inició: %@
ja: セッションは終了しましたが、スリープは開始されませんでした: %@
ko: 세션은 끝났지만 절전이 시작되지 않았어요: %@
ru: Сессия завершена, но сон не начался: %@
zh_hans: 会话已结束，但未能开始睡眠：%@

source: Settings
es: Ajustes
ja: 設定
ko: 설정
ru: Настройки
zh_hans: 设置

source: Short break
es: Pausa breve
ja: 短い休憩
ko: 짧은 휴식
ru: Короткий перерыв
zh_hans: 短暂休息

source: Should %@ get to work too - or take a break?
es: ¿Debería %@ ponerse a trabajar también o tomarse un descanso?
ja: %@も作業を始めますか？それとも休憩しますか？
ko: %@도 일을 시작할까요, 아니면 쉴까요?
ru: Может, %@ тоже возьмётся за работу — или отдохнёт?
zh_hans: 要不要让 %@ 也开始干活，还是休息一下？

source: Show %@
es: Mostrar %@
ja: %@を表示
ko: %@ 보이기
ru: Показать %@
zh_hans: 显示 %@

source: Show %@ on the desktop
es: Mostrar %@ en el escritorio
ja: デスクトップに%@を表示
ko: 바탕화면에 %@ 보이기
ru: Показать %@ на рабочем столе
zh_hans: 在桌面上显示 %@

source: Show the pet on the desktop
es: Mostrar la mascota en el escritorio
ja: デスクトップにペットを表示
ko: 바탕화면에 펫 표시
ru: Показывать питомца на рабочем столе
zh_hans: 在桌面上显示宠物

source: Show the status light and active-agent count on the pet
es: Mostrar la luz de estado y el número de agentes activos en la mascota
ja: ペットに状態ライトとアクティブなエージェント数を表示
ko: 펫에 상태 표시등과 활성 에이전트 수 표시
ru: Показывать индикатор состояния и число активных агентов на питомце
zh_hans: 在宠物上显示状态灯和活跃智能体数量

source: Skin library
es: Biblioteca de skins
ja: スキンライブラリ
ko: 스킨 라이브러리
ru: Библиотека скинов
zh_hans: 皮肤库

source: Sleep protection is active only while awake mode or a timer is running.
es: La protección contra suspensión está activa solo mientras el modo activo o un temporizador esté en marcha.
ja: スリープ防止は、手動の起動モードまたはタイマーが動いている間だけ有効です。
ko: 절전 방지는 깨어 있기 모드나 타이머가 실행 중일 때만 작동해요.
ru: Защита от сна работает, только пока включён режим бодрствования или таймер.
zh_hans: 只有在清醒模式或计时器运行时，防休眠保护才会生效。

source: Snooze - 5 min
es: Posponer - 5 min
ja: スヌーズ - 5分
ko: 5분 뒤에 다시 알림
ru: Отложить — 5 мин
zh_hans: 稍后提醒 - 5 分钟

source: Start a session manually and choose what %@ should do when it ends.
es: Inicia una sesión manualmente y elige qué debe hacer %@ al terminar.
ja: 手動でセッションを開始し、終了時に%@にどう動いてほしいかを選びます。
ko: 세션을 직접 시작하고, 끝났을 때 %@의 동작을 고르세요.
ru: Запусти сессию вручную и выбери, что должен делать %@ по завершении.
zh_hans: 手动开始会话，并选择会话结束时 %@ 要做什么。

source: Start focus
es: Iniciar enfoque
ja: 集中を開始
ko: 집중 시작
ru: Начать фокус
zh_hans: 开始专注

source: Stretching
es: Estirando
ja: ストレッチ
ko: 기지개
ru: Растяжка
zh_hans: 伸展

source: Stretching mood weight
es: Peso del ánimo estirando
ja: ストレッチの気分の重み
ko: 기지개 기분 가중치
ru: Вес настроения «Растяжка»
zh_hans: 伸展情绪权重

source: Sweet No Sleep - AI agent work in progress
es: Sweet No Sleep - trabajo de agente de IA en curso
ja: Sweet No Sleep - AIエージェントの作業中
ko: Sweet No Sleep - AI 에이전트 작업 진행 중
ru: Sweet No Sleep — ИИ-агент работает
zh_hans: Sweet No Sleep - AI 智能体工作进行中

source: Sweet No Sleep - focus session (%d min)
es: Sweet No Sleep - sesión de enfoque (%d min)
ja: Sweet No Sleep - 集中セッション（%d分）
ko: Sweet No Sleep - 집중 세션 (%d분)
ru: Sweet No Sleep — фокус-сессия (%d мин)
zh_hans: Sweet No Sleep - 专注会话（%d 分钟）

source: Sweet No Sleep - manual keep-awake mode
es: Sweet No Sleep - modo manual de mantener activo
ja: Sweet No Sleep - 手動の起動モード
ko: Sweet No Sleep - 수동 깨어 있기 모드
ru: Sweet No Sleep — ручной режим бодрствования
zh_hans: Sweet No Sleep - 手动保持唤醒模式

source: System assertion
es: Bloqueo del sistema
ja: システムのアサーション
ko: 시스템 어서션
ru: Системная блокировка
zh_hans: 系统电源断言

source: System idle sleep is prevented
es: Se evita la suspensión del sistema por inactividad
ja: システムのアイドル時スリープを防止中
ko: 시스템 유휴 절전이 방지되고 있어요
ru: Сон системы при простое предотвращён
zh_hans: 已阻止系统空闲睡眠

source: System will sleep: assertions released
es: El sistema se suspenderá: bloqueos liberados
ja: システムがスリープします: アサーションを解除しました
ko: 시스템이 절전 상태로 들어가요: 어서션 해제됨
ru: Система уснёт: блокировки сняты
zh_hans: 系统将进入睡眠：电源断言已释放

source: System woke: assertions restored
es: El sistema se despertó: bloqueos restaurados
ja: システムが復帰: アサーションを復元しました
ko: 시스템이 깨어났어요: 어서션 복원됨
ru: Система проснулась: блокировки восстановлены
zh_hans: 系统已唤醒：电源断言已恢复

source: TIMED SESSION
es: SESIÓN CON TEMPORIZADOR
ja: タイマーセッション
ko: 타이머 세션
ru: СЕССИЯ ПО ТАЙМЕРУ
zh_hans: 计时会话

source: The AI agent connection was lost - sleep protection ended after timeout
es: Se perdió la conexión con el agente de IA - la protección contra suspensión terminó tras el tiempo límite
ja: AIエージェントとの接続が切れ、タイムアウト後にスリープ防止が終了しました
ko: AI 에이전트 연결이 끊어져 시간 초과 후 절전 방지가 종료됐어요
ru: Соединение с ИИ-агентом потеряно — защита от сна завершилась по тайм-ауту
zh_hans: AI 智能体连接已断开 - 防休眠保护已在超时后结束

source: The AI agent failed.
es: El agente de IA falló.
ja: AIエージェントが失敗しました。
ko: AI 에이전트가 실패했어요.
ru: ИИ-агент завершился с ошибкой.
zh_hans: AI 智能体失败了。

source: The AI agent reported completion.
es: El agente de IA informó de que terminó.
ja: AIエージェントが完了を報告しました。
ko: AI 에이전트가 작업 완료를 알려왔어요.
ru: ИИ-агент сообщил о завершении.
zh_hans: AI 智能体报告已完成。

source: The bridge is off by default. Only trust installed hooks: any local process that can open the URL scheme can send an event. Without a heartbeat, a session expires after 3 minutes. Agent events never trigger immediate sleep.
es: El puente está desactivado por defecto. Confía solo en los hooks instalados: cualquier proceso local que pueda abrir el esquema de URL puede enviar un evento. Sin heartbeat, una sesión caduca tras 3 minutos. Los eventos de agentes nunca activan la suspensión inmediata.
ja: ブリッジはデフォルトでオフです。インストール済みのフックのみを信頼してください。URLスキームを開けるローカルプロセスなら誰でもイベントを送信できます。heartbeat がない場合、セッションは3分で期限切れになります。エージェントのイベントで即座にスリープすることはありません。
ko: 브리지는 기본적으로 꺼져 있어요. 설치한 훅만 신뢰하세요. URL 스킴을 열 수 있는 로컬 프로세스는 누구나 이벤트를 보낼 수 있어요. heartbeat가 없으면 세션은 3분 뒤 만료돼요. 에이전트 이벤트는 즉시 절전을 일으키지 않아요.
ru: Мост по умолчанию выключен. Доверяй только установленным хукам: любой локальный процесс, который может открыть URL-схему, может отправить событие. Без heartbeat сессия истекает через 3 минуты. События агентов никогда не запускают немедленный сон.
zh_hans: 该桥接默认关闭。只信任已安装的钩子：任何能打开 URL 方案的本地进程都可以发送事件。若没有心跳（heartbeat），会话将在 3 分钟后过期。智能体事件永远不会触发立即睡眠。

source: The chest badge shows a green light while agents work, an amber light when one waits for your answer, and the number of active sessions right below it.
es: La insignia del pecho muestra una luz verde mientras trabajan los agentes, una ámbar cuando uno espera tu respuesta, y debajo, el número de sesiones activas.
ja: 胸のバッジは、エージェントの作業中は緑、回答を待っているエージェントがいるとアンバー、その真下にアクティブなセッション数を表示します。
ko: 가슴 배지는 에이전트가 작업하는 동안 초록불, 하나가 답변을 기다리면 주황불을 표시하고, 바로 아래에 활성 세션 수를 보여줘요.
ru: На значке на груди зелёный огонёк горит, пока работают агенты, жёлтый — когда один ждёт твоего ответа, а прямо под ним показано число активных сессий.
zh_hans: 胸前徽章在智能体工作时亮绿灯，有一个等待你回答时亮琥珀色灯，其正下方显示活跃会话数。

source: The exact delay varies slightly within 60 to 120 seconds.
es: El retardo exacto varía ligeramente entre 60 y 120 segundos.
ja: 正確な遅延は60〜120秒の範囲でわずかに変わります。
ko: 정확한 지연 시간은 60~120초 사이에서 약간씩 달라져요.
ru: Точная задержка немного меняется в пределах от 60 до 120 секунд.
zh_hans: 确切的延迟会在 60 到 120 秒之间略有变化。

source: The first stroll starts about 3 seconds after enabling; later strolls begin about every 28 seconds.
es: El primer paseo empieza unos 3 segundos después de activarlo; los siguientes, aproximadamente cada 28 segundos.
ja: 最初の散歩は有効にしてから約3秒後に始まり、その後は約28秒ごとに始まります。
ko: 처음 산책은 켠 뒤 약 3초 뒤에 시작되고, 이후 산책은 약 28초마다 시작돼요.
ru: Первая прогулка начинается примерно через 3 секунды после включения; следующие — примерно каждые 28 секунд.
zh_hans: 首次散步在开启后约 3 秒开始；之后的散步大约每 28 秒开始一次。

source: The pet window is transparent and does not take focus away from your code editor.
es: La ventana de la mascota es transparente y no quita el foco de tu editor de código.
ja: ペットのウインドウは透明で、コードエディタのフォーカスを奪いません。
ko: 펫 창은 투명하며, 코드 편집기에서 포커스를 빼앗지 않아요.
ru: Окно питомца прозрачное и не отвлекает фокус от редактора кода.
zh_hans: 宠物窗口是透明的，不会抢走代码编辑器的焦点。

source: This switch shows the actual state and ends any current session.
es: Este interruptor muestra el estado real y termina cualquier sesión en curso.
ja: このスイッチは実際の状態を示し、現在のセッションを終了します。
ko: 이 스위치는 실제 상태를 보여주며, 진행 중인 세션을 끝내요.
ru: Этот переключатель показывает реальное состояние и завершает текущую сессию.
zh_hans: 此开关显示实际状态，并结束当前的任何会话。

source: Time to look away from the code for a moment.
es: Es hora de apartar la vista del código un momento.
ja: コードから少し目を離しましょう。
ko: 잠깐 코드에서 눈을 떼 볼까요?
ru: Пора ненадолго отвести взгляд от кода.
zh_hans: 该让眼睛离开代码一会儿了。

source: Timer finished - an AI agent is still working
es: El temporizador terminó - un agente de IA sigue trabajando
ja: タイマーが終了 - AIエージェントはまだ作業中です
ko: 타이머가 끝났지만 AI 에이전트는 아직 작업 중이에요
ru: Таймер завершён — ИИ-агент всё ещё работает
zh_hans: 计时结束 - AI 智能体仍在工作

source: Timer finished - manual sleep protection is still on
es: El temporizador terminó - la protección manual contra suspensión sigue activa
ja: タイマーが終了 - 手動のスリープ防止はまだオンです
ko: 타이머가 끝났지만 수동 절전 방지는 아직 켜져 있어요
ru: Таймер завершён — ручная защита от сна всё ещё включена
zh_hans: 计时结束 - 手动防休眠保护仍在开启

source: Turn on manually with no timer
es: Activar manualmente, sin temporizador
ja: タイマーなしで手動オンにする
ko: 타이머 없이 수동으로 켜기
ru: Включить вручную, без таймера
zh_hans: 手动开启，不使用计时器

source: Useful if %@ is part of your everyday work setup.
es: Útil si %@ forma parte de tu configuración de trabajo diaria.
ja: %@が普段の作業環境の一部であれば便利です。
ko: 일상 작업 환경에 %@ 같은 동반자가 있다면 유용해요.
ru: Полезно, если %@ входит в твою повседневную рабочую среду.
zh_hans: 如果 %@ 是你日常工作环境的一部分，会很有用。

source: User folder: ~/Library/Application Support/SweetNoSleep/PetSkins - place one skin.json in each skin folder.
es: Carpeta del usuario: ~/Library/Application Support/SweetNoSleep/PetSkins - coloca un skin.json en cada carpeta de skin.
ja: ユーザーフォルダ: ~/Library/Application Support/SweetNoSleep/PetSkins - 各スキンのフォルダに skin.json を1つ置いてください。
ko: 사용자 폴더: ~/Library/Application Support/SweetNoSleep/PetSkins - 각 스킨 폴더에 skin.json 하나를 넣으세요.
ru: Папка пользователя: ~/Library/Application Support/SweetNoSleep/PetSkins — помести один skin.json в каждую папку скина.
zh_hans: 用户文件夹：~/Library/Application Support/SweetNoSleep/PetSkins - 每个皮肤文件夹中放一个 skin.json。

source: Uses monotonic system uptime; pauses while the Mac is asleep.
es: Usa el tiempo de actividad monótono del sistema; se pausa mientras el Mac está suspendido.
ja: 単調増加するシステム稼働時間を使用し、Macがスリープ中は一時停止します。
ko: 단조 증가하는 시스템 가동 시간을 사용하며, Mac이 잠든 동안에는 멈춰요.
ru: Использует монотонное системное время работы; приостанавливается, пока Mac спит.
zh_hans: 使用单调递增的系统运行时间；Mac 睡眠时暂停。

source: Version %@ (build %@)
es: Versión %@ (compilación %@)
ja: バージョン %@（ビルド %@）
ko: 버전 %@ (빌드 %@)
ru: Версия %@ (сборка %@)
zh_hans: 版本 %@（构建 %@）

source: Waiting for your answer
es: Esperando tu respuesta
ja: 回答を待っています
ko: 답변 대기 중
ru: Ждёт твоего ответа
zh_hans: 等待你的回答

source: Waiting for your answer: %@
es: Esperando tu respuesta: %@
ja: 回答を待っています: %@
ko: 답변 대기 중: %@
ru: Ждёт твоего ответа: %@
zh_hans: 等待你的回答：%@

source: Warm fur and leafy details
es: Pelaje cálido y detalles de hojas
ja: 温かい毛並みと葉っぱのディテール
ko: 따뜻한 털과 잎사귀 디테일
ru: Тёплая шёрстка и листики
zh_hans: 温暖的毛发与叶子细节

source: We recommend the safer option: let macOS follow its normal sleep settings.
es: Recomendamos la opción más segura: deja que macOS siga sus ajustes normales de suspensión.
ja: より安全な方法をおすすめします: macOSの通常のスリープ設定に従わせてください。
ko: 더 안전한 옵션을 권장해요: macOS의 일반 절전 설정을 따르게 하세요.
ru: Рекомендуем более безопасный вариант: пусть macOS следует обычным настройкам сна.
zh_hans: 我们推荐更安全的选项：让 macOS 遵循其正常的睡眠设置。

source: Webhook listener failed: %@
es: Error del listener de webhook: %@
ja: Webhookリスナーが失敗しました: %@
ko: 웹훅 리스너 실패: %@
ru: Ошибка слушателя webhook: %@
zh_hans: Webhook 监听失败：%@
